{
  "backend/main.mo": "Motoko actor defining the backend canister with contact form submission/retrieval and user profile management, protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting the requirement to expand the Techniques page with 9 additional organic farming technique cards, each with enriched structured content, responsive grid layout, and scroll animations.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files, describing the purpose and key features of each page and component in the Agro Crops application.",
  "frontend/index.css": "Root Tailwind CSS entry file defining OKLCH-based CSS custom property color tokens for light and dark themes, including sidebar, chart, and semantic UI color variables.",
  "frontend/index.html": "HTML entry point for the Agro Crops React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main React app file setting up TanStack Router with auth-guarded routes, a global CartContext provider, and a shared Layout with Header and Footer wrapping all pages.",
  "frontend/src/components/AnimatedSection.tsx": "Reusable wrapper component that uses IntersectionObserver to trigger CSS animations (fadeIn, slideUp, zoomIn, etc.) when the section scrolls into view, with configurable delay and threshold.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Agro Crops brand, a full navigation quick-links list, and a contact section with clickable email, phone, and location details.",
  "frontend/src/components/Header.tsx": "Sticky site header with desktop/mobile navigation, a cart sheet with checkout flow (cart → customer details → success), and logout functionality using session storage for auth state.",
  "frontend/src/components/LanguageSwitcher.tsx": "Renders a row of buttons to switch between English, Hindi, and Marathi languages using the LanguageContext.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart and wishlist state with add, remove, update quantity, clear, and wishlist toggle operations, plus derived cartCount and cartTotal values.",
  "frontend/src/contexts/LanguageContext.tsx": "React context that manages the active language (en/hi/mr), persists it to localStorage, and exposes a translation lookup function `t` with English fallback.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity; invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and expose identity and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Exports a useSubmitContact mutation hook that calls the backend actor's submitContact method and invalidates the contacts query on success.",
  "frontend/src/index.css": "Global stylesheet importing Poppins and Merriweather fonts, defining Tailwind base/component/utility layers, a green-themed OKLCH CSS variable palette with dark mode, and keyframe animation utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders the About page with a hero section, stats grid, mission/vision cards, and a team section displaying member names, roles, and contact info using i18n translations.",
  "frontend/src/pages/Cattle.tsx": "Displays detailed information about farm animals (cow, buffalo, goat, poultry, sheep) including breeds, feed, health, diseases, housing, productivity, and market value.",
  "frontend/src/pages/Contact.tsx": "Provides a contact form that submits messages via Formspree for email delivery and optionally persists them to a backend actor, with validation and error handling.",
  "frontend/src/pages/Equipment.tsx": "Lists farm equipment items with details like category, specs, usage, and tutorial links, supporting search/filter by category and expandable detail views.",
  "frontend/src/pages/Farm.tsx": "Shows a searchable crop guide table with season, soil type, benefits, and tips for various crops, plus a list of organic farming benefits, using i18n translations.",
  "frontend/src/pages/GovernmentSchemes.tsx": "Displays a detailed list of Indian government agricultural schemes (PM-KISAN, PMFBY, KCC, NMSA, etc.) with descriptions, benefits, eligibility, and links to official websites.",
  "frontend/src/pages/Home.tsx": "The landing page showcasing organic farming benefits, region-specific crops, government schemes overview, and future scope sections with navigation links to shop and techniques pages.",
  "frontend/src/pages/OtpVerification.tsx": "A 4-digit OTP verification page that validates a demo OTP ('1234'), sets session authentication on success, and redirects to the home page.",
  "frontend/src/pages/Shop.tsx": "An e-commerce shop page listing organic products (seeds, fertilizers, etc.) with search, category filtering, cart, and wishlist functionality.",
  "frontend/src/pages/Signup.tsx": "A signup page that collects a 10-digit mobile number, stores it in sessionStorage, and navigates to the OTP verification page.",
  "frontend/src/pages/Techniques.tsx": "React page displaying organic farming techniques (composting, pest control, crop rotation, etc.) with expandable cards showing steps, benefits, tools, and pro tips. Uses Lucide icons and a language context for i18n.",
  "frontend/src/utils/translations.ts": "Centralized translation strings for English, Hindi, and Marathi covering all pages and UI elements in the application. Used by the LanguageContext to support multi-language switching.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support. Includes a helper to remove sensitive params from the URL without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom green/brown color tokens, typography/container-queries/animate plugins, custom fonts (Poppins, Merriweather), border radii, box shadows, and accordion keyframe animations.",
  "project_state.json": "Project state snapshot (version 43) describing the Agro Crops organic farming website's architecture, existing features, known issues (cart, auth redirect, contact form), and multi-page/multi-language design notes."
}