{
  "backend/main.mo": "Motoko actor implementing a contact form submission system and user profile management with role-based access control (admin/user permissions) using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: a Customer Details checkout form in the cart drawer, and a Government Schemes page listing 6 Indian agricultural schemes with navigation link.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose and key contents, used as a build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom property color tokens for light and dark themes, including sidebar, chart, and semantic UI color variables.",
  "frontend/index.html": "Minimal HTML shell for the Agro Crops React app, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with auth-guarded main routes and public auth routes, wrapping everything in a CartProvider and including all page routes including /schemes.",
  "frontend/src/components/AnimatedSection.tsx": "Reusable wrapper component that uses IntersectionObserver to trigger CSS animations (fadeIn, slideUp, zoomIn, etc.) on child content when it scrolls into view.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, and a contact section showing real email and phone as clickable mailto/tel links, plus a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop/mobile nav links, and a cart sheet that supports item management, customer detail form validation, and order checkout with success state.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart and wishlist state management, including add, remove, update quantity, clear, and toggle wishlist operations with derived cartCount and cartTotal.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Exports a useSubmitContact mutation hook that calls the backend actor's submitContact method and invalidates the contacts query on success.",
  "frontend/src/index.css": "Global stylesheet importing Poppins and Merriweather fonts, defining Tailwind layers with a green eco-friendly CSS custom property palette (light/dark), and utility animation classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying a gradient hero header, stats grid, and mission/vision section with animated sections, team members, and contact info for the Agro Crops platform.",
  "frontend/src/pages/Cattle.tsx": "Displays an interactive guide to organic livestock farming (cow, buffalo, goat, sheep, poultry) with searchable animal cards showing breed, food, care, and detailed information, plus a benefits section.",
  "frontend/src/pages/Contact.tsx": "Renders a contact page with a validated form (name, email, message) that submits via a React Query mutation, alongside static contact info (email, phone, address).",
  "frontend/src/pages/Equipment.tsx": "Shows a searchable catalog of farm equipment (tractor, plough, thresher, etc.) with category, description, uses, and power details, plus a maintenance tips section.",
  "frontend/src/pages/Farm.tsx": "Provides a searchable organic crop guide covering seven crops (wheat, rice, maize, etc.) with season, soil type, cultivation guidance, and tips, along with a benefits section.",
  "frontend/src/pages/GovernmentSchemes.tsx": "Lists major Indian government agricultural schemes (PM-KISAN, PMFBY, KCC, NMSA, Soil Health Card, etc.) with descriptions, benefits, and eligibility details in styled cards.",
  "frontend/src/pages/Home.tsx": "Landing page for the Agro Crops app featuring a hero section, organic farming benefits, region-based crop info, government schemes, and future feature roadmap. Uses animated sections and interactive region selector.",
  "frontend/src/pages/OtpVerification.tsx": "OTP verification page with a 4-digit input flow using sessionStorage for demo auth (hardcoded OTP '1234'). Redirects authenticated users away and navigates to home on success.",
  "frontend/src/pages/Shop.tsx": "Organic product shop page displaying seeds, vegetables, and fertilizers with category filtering, search, wishlist, and add-to-cart functionality via CartContext.",
  "frontend/src/pages/Signup.tsx": "Signup page that collects a 10-digit mobile number, validates it, stores it in sessionStorage, and navigates to the OTP verification page. Redirects already-authenticated users.",
  "frontend/src/pages/Techniques.tsx": "Informational page detailing organic farming techniques including composting, pest control, crop rotation, and additional methods like mulching and drip irrigation with step-by-step breakdowns.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom green/brown color palette using OKLCH variables, extended typography, border radius, box shadows, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state snapshot for an organic farming management system, documenting version, feature list, architectural notes, and known issues such as broken cart functionality and signup routing problems."
}