{
  "backend/main.mo": "Main Motoko actor that handles contact form submissions, user profile storage, and access-controlled queries using AccessControl, MixinAuthorization, and MixinStorage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (language switcher fix, VoiceReader component, etc.) to their affected files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing short prose summaries of each frontend source file, describing the purpose and key features of every page and component in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining CSS custom property tokens for light and dark themes (background, foreground, primary, chart colors, sidebar, etc.) applied via @layer base.",
  "frontend/index.html": "Minimal HTML shell for the Agro Crops Vite/React app, mounting the React root div and loading the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root app file that sets up TanStack Router with all page routes, CartContext/CartProvider for shopping cart state, LanguageProvider wrapping the full tree, and an AuthLayout that conditionally renders the VoiceReader on authenticated pages.",
  "frontend/src/components/AnimatedSection.tsx": "Reusable wrapper component that uses IntersectionObserver to trigger CSS animation classes (fadeIn, slideUp, zoomIn, etc.) when the section scrolls into view.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, translated quick-navigation links, and real contact details (email, phone, location) with clickable mailto/tel links and a copyright line.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, a slide-out shopping cart sheet with checkout flow (cart → details → success), mobile menu, and language switcher.",
  "frontend/src/components/LanguageSwitcher.tsx": "Renders a pill-style toggle button group for switching between English, Hindi, and Marathi using the LanguageContext.",
  "frontend/src/components/VoiceReader.tsx": "Floating text-to-speech widget that reads visible page content aloud using the Web Speech API, supporting play/pause/stop and the active language.",
  "frontend/src/contexts/CartContext.tsx": "Thin re-export file that exposes the useCart hook and CartItem type from App.tsx for convenience.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider that manages the active language (en/hi/mr), persists it to localStorage, and exposes a translation helper t().",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) via React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state and persisting the identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting a contact form (useMutation) and fetching all contacts (useQuery) via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind with eco-themed CSS custom properties for colors, and defines reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders the About page with a hero section, animated stats, mission/vision cards, and a team grid displaying member contact info using the LanguageContext for translations.",
  "frontend/src/pages/Cattle.tsx": "Displays detailed livestock care guides for various animals (cow, buffalo, goat, poultry, sheep, etc.) including breeds, feed, health, housing, productivity, and market value information.",
  "frontend/src/pages/Contact.tsx": "Provides a contact form that validates input, submits to Formspree for email delivery, and optionally persists the message to the ICP backend actor, with success/error state handling.",
  "frontend/src/pages/CropSuggestions.tsx": "Presents region-specific crop recommendations with detailed info (sowing season, soil type, yield, water needs, organic tips, pests) organized by Indian state/region.",
  "frontend/src/pages/Equipment.tsx": "Lists farm equipment items across categories (tillage, seeding, harvesting, etc.) with specs, usage details, and embedded YouTube tutorial links, supporting search and category filtering.",
  "frontend/src/pages/Farm.tsx": "Displays a searchable crop guide with 22 crops, each showing season, soil type, benefits, and farming tips. Uses language context for i18n and AnimatedSection for scroll animations.",
  "frontend/src/pages/GovernmentSchemes.tsx": "Renders detailed cards for Indian government agricultural schemes (PM-KISAN, PMFBY, KCC, NMSA, etc.) including benefits, eligibility, and official apply links.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero banner, organic farming benefits grid, region-wise crop highlights, and government scheme previews with navigation links.",
  "frontend/src/pages/OtpVerification.tsx": "Four-digit OTP verification page that validates against hardcoded '1234', sets session authentication on success, and supports resend functionality.",
  "frontend/src/pages/Shop.tsx": "E-commerce shop page with a large product catalog (seeds, fertilizers, tools, etc.) supporting search, category filtering, cart addition, and wishlist via toast notifications.",
  "frontend/src/pages/Signup.tsx": "Mobile number sign-up page that validates a 10-digit number, stores it in sessionStorage, and navigates to the OTP verification page.",
  "frontend/src/pages/Techniques.tsx": "React page displaying organic farming techniques (composting, pest control, crop rotation, etc.) with expandable cards showing steps, benefits, tools, and pro tips. Uses language context and animated sections.",
  "frontend/src/utils/translations.ts": "Defines TypeScript translation strings for English, Hindi, and Marathi across all app pages including nav, shop, cattle, equipment, schemes, and contact sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, with sessionStorage persistence helpers for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom eco/green colors, Nunito/Montserrat fonts, card shadows, border radii, and keyframe animations (fadeIn, slideUp, zoomIn, etc.).",
  "project_state.json": "Project state snapshot (version 51) describing the Agro Crops organic farming website architecture, existing features, known issues (cart, auth redirect, contact form, language switcher), and design/animation guidelines."
}