{
  "backend/main.mo": "Motoko actor defining the backend canister with contact form submission, contact retrieval, and user profile management, all protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report mapping implemented features (LanguageContext, translations file, language switcher integration) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the content and functionality of pages and components in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom property tokens for light and dark themes, covering colors for background, foreground, primary, secondary, destructive, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'Agro Crops', mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with auth-guarded routes, a global CartContext provider, and wraps the app with LanguageProvider and InternetIdentityProvider.",
  "frontend/src/components/AnimatedSection.tsx": "Reusable wrapper component that uses IntersectionObserver to trigger CSS animations (fadeIn, slideUp, zoomIn, slideInLeft, slideInRight) when the section scrolls into view.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, translated quick-nav links, and real contact details (email, phone, location) as clickable links, with a copyright line and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky site header with desktop/mobile navigation, a cart sheet with checkout flow (cart → customer details → success), and logout functionality using session storage for auth state.",
  "frontend/src/components/LanguageSwitcher.tsx": "Renders a row of buttons to switch between English, Hindi, and Marathi languages using the LanguageContext.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart and wishlist state with add, remove, update quantity, clear, and wishlist toggle operations, plus derived totals.",
  "frontend/src/contexts/LanguageContext.tsx": "React context that manages the active language (en/hi/mr), persists it to localStorage, and exposes a translation lookup function with English fallback.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and expose identity and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Exports a useSubmitContact mutation hook that calls the backend actor's submitContact method and invalidates the contacts query on success.",
  "frontend/src/index.css": "Global stylesheet importing Poppins and Merriweather fonts, defining a green-themed OKLCH CSS variable palette with dark mode, and declaring reusable animation utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders the About page with a hero section, stats grid, mission/vision cards, and team member profiles using i18n translations via useLanguage context.",
  "frontend/src/pages/Cattle.tsx": "Displays an organic livestock guide page with searchable/expandable animal cards (cow, buffalo, goat, sheep, poultry) covering breed, food, care, and farming details, plus a benefits section.",
  "frontend/src/pages/Contact.tsx": "Renders a contact page with a validated form (name, email, message) that submits via a React Query mutation, alongside static contact info (email, phone, address).",
  "frontend/src/pages/Equipment.tsx": "Displays a filterable, searchable catalog of farm equipment items with detailed specs, usage info, and embedded YouTube tutorial links, organized by category.",
  "frontend/src/pages/Farm.tsx": "Shows a searchable crop guide table listing crops with season, soil type, benefits, and tips, plus a section highlighting organic farming benefits, with i18n support.",
  "frontend/src/pages/GovernmentSchemes.tsx": "Displays a list of Indian government agricultural schemes (PM-KISAN, PMFBY, KCC, NMSA, SHC, etc.) with details on benefits and eligibility, rendered using AnimatedSection and Lucide icons.",
  "frontend/src/pages/Home.tsx": "The landing page showcasing a hero section, organic farming benefits, region-wise crops, government scheme highlights, and future scope items, using i18n translations and React Router links.",
  "frontend/src/pages/OtpVerification.tsx": "A 4-digit OTP verification page that validates a demo OTP ('1234'), manages digit-by-digit input with refs, and sets session authentication before redirecting to home.",
  "frontend/src/pages/Shop.tsx": "An e-commerce shop page listing organic products (seeds, vegetables, fertilizers) with search and category filtering, supporting add-to-cart functionality with toast notifications.",
  "frontend/src/pages/Signup.tsx": "A signup page that collects a 10-digit Indian mobile number, validates it, stores it in sessionStorage, and navigates to the OTP verification page.",
  "frontend/src/pages/Techniques.tsx": "Displays a grid of nine organic farming techniques (composting, crop rotation, drip irrigation, etc.) with icons and i18n-translated descriptions.",
  "frontend/src/utils/translations.ts": "Defines a multilingual translations object (English, Hindi, Marathi) covering all UI strings across navigation, pages, and features of the Agro Crops application.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with a custom green/brown color palette using OKLCH variables, custom fonts, border radii, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall project state (version 19) for the Agro Crops organic farming website, documenting architectural notes, known issues, and a list of all implemented features with their requirement IDs."
}